
class Urls:

    scooter_main = 'https://qa-scooter.praktikum-services.ru/'
    scooter_order = 'https://qa-scooter.praktikum-services.ru/order'
    dzen_redirect = 'https://dzen.ru/?yredirect=true'


class AnswersText:
    answer_how_much_text = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    answer_multiple_text = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    answer_calc_time_text = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    answer_order_today_text = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    answer_prolongation_text = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    answer_charger_text = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    answer_cancel_text = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    answer_across_MKAD_text = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'


class RegistrationData:
    registration_data_1 = ['Грегори', 'Хаус', 'Нью Джерси, Улица 44', '89965544999']
    registration_data_2 = ['Блэк', 'Саймон', 'Лос Анджелес, Вейв-стрит 45', '89963374999']
